products/admin/fedexwsdl/RateRequest_Priority_Alert_Plus.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/rate/v12">
<soapenv:Header/>
<soapenv:Body>
<v12:RateRequest>
<v12:WebAuthenticationDetail>
<v12:CspCredential>
<v12:Key></v12:Key>
<v12:Password></v12:Password>
</v12:CspCredential>
<v12:UserCredential>
<v12:Key></v12:Key>
<v12:Password/>
</v12:UserCredential>
</v12:WebAuthenticationDetail>
<v12:ClientDetail>
<v12:AccountNumber></v12:AccountNumber>
<v12:MeterNumber></v12:MeterNumber>
<v12:ClientProductId></v12:ClientProductId>
<v12:ClientProductVersion></v12:ClientProductVersion>
</v12:ClientDetail>
<v12:TransactionDetail>
<v12:CustomerTransactionId>Basic Rate Request</v12:CustomerTransactionId>
</v12:TransactionDetail>
<v12:Version>
<v12:ServiceId>crs</v12:ServiceId>
<v12:Major>12</v12:Major>
<v12:Intermediate>0</v12:Intermediate>
<v12:Minor>0</v12:Minor>
</v12:Version>
<v12:RequestedShipment>
<v12:ShipTimestamp>2012-05-07T12:34:56-06:00</v12:ShipTimestamp>
<v12:DropoffType>REGULAR_PICKUP</v12:DropoffType>
<v12:ServiceType>INTERNATIONAL_PRIORITY</v12:ServiceType>
<v12:PackagingType>YOUR_PACKAGING</v12:PackagingType>
<v12:PreferredCurrency>USD</v12:PreferredCurrency>
<v12:Shipper>
<v12:Contact>
<v12:PersonName>Shriyash</v12:PersonName>
<v12:CompanyName>WAPISENDER-WBUS1100</v12:CompanyName>
<v12:PhoneNumber>9012704839</v12:PhoneNumber>
<v12:EMailAddress>Shriyash_Khisti@syntelinc.com</v12:EMailAddress>
</v12:Contact>
<v12:Address>
<v12:StreetLines>Sender_Address_Line1</v12:StreetLines>
<v12:StreetLines>Sender_Address_Line2</v12:StreetLines>
<v12:City>MEMPHIS</v12:City>
<v12:StateOrProvinceCode>TN</v12:StateOrProvinceCode>
<v12:PostalCode>38110</v12:PostalCode>
<v12:CountryCode>US</v12:CountryCode>
</v12:Address>
</v12:Shipper>
<v12:Recipient>
<v12:Contact>
<v12:PersonName>Shriyash</v12:PersonName>
<v12:CompanyName>CSCSWAPI-WBUS1100</v12:CompanyName>
<v12:PhoneNumber>9018549236</v12:PhoneNumber>
<v12:EMailAddress>Shriyash_Khisti@syntelinc.com</v12:EMailAddress>
</v12:Contact>
<v12:Address>
<v12:StreetLines>Recipient_Address_Line1</v12:StreetLines>
<v12:StreetLines>Recipient_Address_Line2</v12:StreetLines>
<v12:City>RICHMOND</v12:City>
<v12:StateOrProvinceCode>BC</v12:StateOrProvinceCode>
<v12:PostalCode>V7C4v7</v12:PostalCode>
<v12:CountryCode>CA</v12:CountryCode>
</v12:Address>
</v12:Recipient>
<v12:ShippingChargesPayment>
<v12:PaymentType>SENDER</v12:PaymentType>
<v12:Payor>
<v12:ResponsibleParty>
<v12:AccountNumber></v12:AccountNumber>
<v12:Tins>
<v12:TinType>BUSINESS_STATE</v12:TinType>
<v12:Number>123456</v12:Number>
</v12:Tins>
</v12:ResponsibleParty>
</v12:Payor>
</v12:ShippingChargesPayment>
<v12:CustomsClearanceDetail>
<v12:DutiesPayment>
<v12:PaymentType>SENDER</v12:PaymentType>
<v12:Payor>
<v12:ResponsibleParty>
<v12:AccountNumber>150067065</v12:AccountNumber>
<v12:Tins>
<v12:TinType>BUSINESS_STATE</v12:TinType>
<v12:Number>123456</v12:Number>
</v12:Tins>
</v12:ResponsibleParty>
</v12:Payor>
</v12:DutiesPayment>
<v12:DocumentContent>DOCUMENTS_ONLY</v12:DocumentContent>
<v12:CustomsValue>
<v12:Currency>USD</v12:Currency>
<v12:Amount>100.00</v12:Amount>
</v12:CustomsValue>
<v12:CommercialInvoice>
<v12:TermsOfSale>FOB_OR_FCA</v12:TermsOfSale>
</v12:CommercialInvoice>
<v12:Commodities>
<v12:NumberOfPieces>1</v12:NumberOfPieces>
<v12:Description>ABCD</v12:Description>
<v12:CountryOfManufacture>US</v12:CountryOfManufacture>
<v12:Weight>
<v12:Units>LB</v12:Units>
<v12:Value>1.0</v12:Value>
</v12:Weight>
<v12:Quantity>1</v12:Quantity>
<v12:QuantityUnits>cm</v12:QuantityUnits>
<v12:UnitPrice>
<v12:Currency>USD</v12:Currency>
<v12:Amount>1.000000</v12:Amount>
</v12:UnitPrice>
<v12:CustomsValue>
<v12:Currency>USD</v12:Currency>
<v12:Amount>100.000000</v12:Amount>
</v12:CustomsValue>
</v12:Commodities>
<v12:ExportDetail>
<v12:ExportComplianceStatement>30.37(f)</v12:ExportComplianceStatement>
</v12:ExportDetail>
</v12:CustomsClearanceDetail>
<v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes>
<v12:PackageCount>1</v12:PackageCount>
<v12:RequestedPackageLineItems>
<v12:SequenceNumber>1</v12:SequenceNumber>
<v12:GroupNumber>1</v12:GroupNumber>
<v12:GroupPackageCount>1</v12:GroupPackageCount>
<v12:Weight>
<v12:Units>LB</v12:Units>
<v12:Value>20.0</v12:Value>
</v12:Weight>
<v12:Dimensions>
<v12:Length>12</v12:Length>
<v12:Width>12</v12:Width>
<v12:Height>12</v12:Height>
<v12:Units>IN</v12:Units>
</v12:Dimensions>
<v12:CustomerReferences>
<v12:CustomerReferenceType>CUSTOMER_REFERENCE</v12:CustomerReferenceType>
<v12:Value>string</v12:Value>
</v12:CustomerReferences>
<v12:SpecialServicesRequested>
<v12:SpecialServiceTypes>PRIORITY_ALERT</v12:SpecialServiceTypes>
<v12:PriorityAlertDetail>
<v12:EnhancementTypes>PRIORITY_ALERT_PLUS</v12:EnhancementTypes>
<v12:Content>PA</v12:Content>
</v12:PriorityAlertDetail>
</v12:SpecialServicesRequested>
</v12:RequestedPackageLineItems>
</v12:RequestedShipment>
</v12:RateRequest>
</soapenv:Body>
</soapenv:Envelope>